replacements = [
  ('!', ''),
  ('?', ''),
  ('%', ''),
  (':', ''),
  (';', ''),
  (',', ''),
  ('.', ''),
  ('"', ''),
  ("'", ''),
  ('(', ''),
  (')', ''),
  ('/', ''),
  ('|', ''),
  ('\\', ''),
  ('_', ' '),
  ('*', ''),
  ('★', ''),
  ('☆', ''),
  (' - ', ' '),
  ('-', ' '),
  (' + ', ' '),
  ('+', ''),
  (' & ', ' '),
  ('&', ' '),
  ('á', 'a'),
  ('à', 'a'),
  ('ǎ', 'a'),
  ('å', 'a'),
  ('â', 'a'),
  ('@', 'a'),
  ('é', 'e'),
  ('ē', 'e'),
  ('è', 'e'),
  ('ì', 'i'),
  ('ō', 'o'),
  ('ô', 'o'),
  ('ū', 'u'),
  ('\n', ''),
  ('\t', '')
]

def clean_string(str):
  cleaned_str = str.lower().strip()
  for replacement in replacements:
    cleaned_str = cleaned_str.replace(replacement[0], replacement[1])
  return cleaned_str
